src/mp_toir/Documents/НаработкаОбъектовЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НаработкаОбъектовЭксплуатации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>мп_СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Catalogs/ОбъектыЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологическоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мечел_ТехнологическиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКУчету</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаработкаНаДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/Catalogs/КлассыОбъектовЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлассыОбъектовЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиНаработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>мп_ВидыПроверок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПроверокОборудования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/Documents/НаработкаОбъектовЭксплуатации/Forms/ФормаСтрокиНаработки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "НомерСтроки, ТехнологическоеМесто, ОбъектЭксплуатации, Узел,"
		+ "ПоказательНаработки, Значение";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ИменаЭлементов + ", ФормаЗаписать", "Доступность", Не Параметры.ТолькоПросмотр);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если Не ЭтотОбъект.СохранитьИзменения Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("НомерСтроки", ЭтотОбъект.НомерСтроки);
	ЗначенияСтроки.Вставить("ТехнологическоеМесто", ЭтотОбъект.ТехнологическоеМесто);
	ЗначенияСтроки.Вставить("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	ЗначенияСтроки.Вставить("Узел", ЭтотОбъект.Узел);
	ЗначенияСтроки.Вставить("ПоказательНаработки", ЭтотОбъект.ПоказательНаработки);
	ЗначенияСтроки.Вставить("Значение", ЭтотОбъект.Значение);

	ОповеститьОВыборе(ЗначенияСтроки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТехнологическоеМестоПриИзменении(Элемент)

	ВыбранныйЭлемент = ОбщегоНазначенияВызовСервера.ОбъектыЭксплуатацииПоТехМесту(
		ЭтотОбъект.ТехнологическоеМесто, Истина);
	
	Если ТипЗнч(ВыбранныйЭлемент) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		Если ЭтотОбъект.ОбъектЭксплуатации <> ВыбранныйЭлемент Тогда
			ЭтотОбъект.ОбъектЭксплуатации = ВыбранныйЭлемент;
			ОчиститьПодчиненныеЭлементыТехМеста();
		КонецЕсли;
	Иначе
		ЭтотОбъект.ВыбранныйЭлемент =
			ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка");
			
		ОчиститьПодчиненныеЭлементыТехМеста();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)

	ЭтотОбъект.ТехнологическоеМесто =
		НаработкиОбъектЭксплуатацииПриИзмененииНаСервере(ЭтотОбъект.ОбъектЭксплуатации);

	ОчиститьПодчиненныеЭлементыТехМеста();

КонецПроцедуры

&НаКлиенте
Процедура УзелНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	ОбъектЭксплуатации = ЭтотОбъект.ОбъектЭксплуатации;
	Если Не ЗначениеЗаполнено(ОбъектЭксплуатации) Тогда
		Возврат;
	КонецЕсли;
	ДоступныеУзлы =
		УзлыПоНаработке(ОбъектЭксплуатации);
		
	Если ДоступныеУзлы = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеУзлы);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
КонецПроцедуры

&НаКлиенте
Процедура УзелПриИзменении(Элемент)

	ЭтотОбъект.ПоказательНаработки =
		ПредопределенноеЗначение("Справочник.ПоказателиНаработки.ПустаяСсылка");

	ЭтотОбъект.Значение = 0;

КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)

	ПустойУзел = ПредопределенноеЗначение("Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка");
	ПустойПоказатель = ПредопределенноеЗначение("Справочник.ПоказателиНаработки.ПустаяСсылка");
	Если ПустойУзел = ЭтотОбъект.Узел Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите узел объекта эксплуатации", , "Узел");
		Возврат;
	КонецЕсли;
	
	Если ПустойПоказатель = ЭтотОбъект.ПоказательНаработки Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите показатель", , "ПоказательНаработки");
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.Значение = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите значение показателя", , "Значение");
		Возврат;
	КонецЕсли;

	ЭтотОбъект.СохранитьИзменения = Истина;
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьПодчиненныеЭлементыТехМеста()

	ЭтотОбъект.Узел =
		ПредопределенноеЗначение("Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка");

	ЭтотОбъект.ПоказательНаработки =
		ПредопределенноеЗначение("Справочник.ПоказателиНаработки.ПустаяСсылка");

	ЭтотОбъект.Значение = 0;

КонецПроцедуры

&НаСервереБезКонтекста
Функция НаработкиОбъектЭксплуатацииПриИзмененииНаСервере(Знач ОбъектЭксплуатации)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЭксплуатации, "ТехнологическоеМесто");

КонецФункции

&НаСервереБезКонтекста
Функция УзлыПоНаработке(Знач ОбъектЭксплуатации)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УзлыОбъектовЭксплуатации.Ссылка КАК Узел,
	|	УзлыОбъектовЭксплуатации.Класс КАК Класс
	|ПОМЕСТИТЬ вт_Узлы
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|ГДЕ
	|	УзлыОбъектовЭксплуатации.Владелец = &ОбъектЭксплуатации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Узлы.Узел КАК Узел
	|ИЗ
	|	вт_Узлы КАК вт_Узлы";
	
	Запрос.УстановитьПараметр("ОбъектЭксплуатации", ОбъектЭксплуатации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Узел");
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПоказательНаработкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Узел = ЭтотОбъект.Узел;
	МассивЭлементов = Новый Массив;
	Если ЗначениеЗаполнено(Узел) Тогда
		Наработки = НаработкиУзла(Узел);
		Если Не Наработки = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Наработки);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			ПоказатьПредупреждение(, "У класса узла нет показателей наработки", 30);
			Возврат;
		КонецЕсли;
	Иначе
			СтандартнаяОбработка = Ложь;
	КонецЕсли;
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаработкиУзла(Знач Узел)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассыОбъектовЭксплуатации.Ссылка КАК Класс
	|ПОМЕСТИТЬ вт_КлассОбъект
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассыОбъектовЭксплуатации КАК КлассыОбъектовЭксплуатации
	|		ПО УзлыОбъектовЭксплуатации.Класс = КлассыОбъектовЭксплуатации.Ссылка
	|			И (&Узел = УзлыОбъектовЭксплуатации.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассыОбъектовЭксплуатацииПоказателиНаработки.ПоказательНаработки КАК Наработки
	|ИЗ
	|	вт_КлассОбъект КАК вт_КлассОбъект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассыОбъектовЭксплуатации.ПоказателиНаработки КАК КлассыОбъектовЭксплуатацииПоказателиНаработки
	|		ПО вт_КлассОбъект.Класс = КлассыОбъектовЭксплуатацииПоказателиНаработки.Ссылка";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Наработки");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
